reinstatement_title = "# Восстановление во фракцию"
reinstatement_submission = (
    "### Подача заявления\n"
    "Чтобы восстановиться во фракцию воспользуйтесь кнопкой снизу."
)
reinstatement_requirements = """### Требования к заявлению
1. Восстановление невозможно, если имя или фамилия были изменены.
2. С момента увольнения должно пройти не более месяца.
3. Удостоверение прилагается целиком, без правок и обрезки.
4. Причиной увольнения должно быть собственное желание."""
reinstatement_system = """### Система восстановления
- Сотрудник восстанавливается в звании на 3 ранга ниже прежнего.
- Спецподразделения не учитываются, восстановление только в звании.
"""

role_title = "# Подача заявления на роль"
role_submission = (
    "### Подача заявления\nЧтобы подать заявление на роль воспользуйтесь кнопкой снизу."
)
role_requirements = """### Информация
1. Убедитесь в достоверности введённых данных.
2. Заявления рассматриваются в течение 24 часов.
"""

supply_audit_title = "# Аудит выдачи снаряжения"
supply_audit_description = (
    "### Аудит выдачи снаряжения\n"
    "Вы можете отправить в аудит запись о чистке, выдаче склада."
)

timeoff_title = "# Подача заявления на отгул"
timeoff_submission = "### Подача заявления\nЧтобы подать заявление на отгул воспользуйтесь кнопкой снизу."

timeoff_description = """### Информация
1. Заявления доступны со звания Сержант.
2. Заявления можно подать только на сегодняшний день.
3. Разрешено брать отгул только один раз в день.
4. Запрещено брать отгул в промежуток с 12:00 до 15:00 и с 20:00 до 22:00."""

patrol_title = "# ⚔️ Запрос формы СОБР"
patrol_rules = """
### Правила ношения формы:
1. Запрос действителен до рестарта (03:00 МСК).
2. Запрос действителен только на СОВМЕСТНУЮ работу.
3. Во время патруля вы находитесь полностью под руководством СОБР.
4. Перед подачей запроса нужно получить устное одобрение в <#1417974972437233764>
5. Если вам одобрили запрос — наденьте форму СОБР в раздевалке и сообщите о готовности
6. Закончили патруль — сняли форму. Бегать в ней одному — нарушение.
7. Если бойцов нет — ждите их в <#1417974972437233764>. Самодеятельность запрещена.
### Правила проведения патруля:
1. Не афкшим и не втыкаем — всегда находимся рядом с группой СОБР.
2. Если упали (300-й) — сообщите об этом **1 раз**, вас поднимут.
3. Если добили — заряжайтесь на ГС и ждите, сообщив об этом **1 раз**.
4. Скринить налёты, поставки и ограбления — можно
"""

ic_leave_title = "# 🏖️ IC Отпуск"
ic_leave_description = """### Информация
1. Отпуск можно взять 1 раз в месяц.
2. Отпуск можно взять на срок до 5 дней.
3. Если во время отпуска вы находитесь на службе, отпуск аннулируется.
"""

ooc_leave_title = "# 🏖️ OOC Отпуск"
ooc_leave_description = """### Информация
1. Отпуск можно взять на срок от 7 до 30 дней.
2. Если во время отпуска вы находитесь в игре, отпуск аннулируется.
3. Действующий OOC отпуск защищает вас от увольнения за неактив.
"""

promotion_title = "# Рапорт на повышение"
promotion_description = """### Информация
1. Рапорт проверяется в течение 24 часов.
2. Одни и те же скриншоты нельзя использовать дважды.
3. Можно заранее выполнять условия для следующих званий.
"""
